--Заповнення таблиць
USE SMART_HEATING

--Таблиця "Райони міста" 
--  потрібно заповнити стовпці:
--    * "Назва району"
Insert into Districts (DistrictName) values
('Довгинцівський'),     --1
('Інгулецький'),        --2
('Металургійний'),      --3
('Покровський'),        --4
('Саксаганський'),      --5
('Тернівський'),        --6
('Центрально-Міський')  --7

--Таблиця "Вулиці міста" (потрібно заповнити стовпці "Назва вулиці" та "ID району")
--  потрібно заповнити стовпці:
--    * "Назва вулиці"
--    * "ID району"
Insert into Streets (StreetName, District) values
('Бикова', 5),                  --1--Саксаганський район
('Свято-Миколаївська', 7),      --2--Центрально-Міський район
('Дніпровське шосе', 1),        --3--Довгинцівський район
('Кропивницького', 4),          --4--Покровський район
('Молодіжна', 3),               --5--Металургійний район
('Володимира Великого', 5),     --6--Саксаганський район
('Проспект Миру', 3),           --7--Металургійний район
('Короленка', 6),               --8--Тернівський район
('Площа Гірницької Слави', 2),  --9--Інгулецький район
('Шурупова', 4),                --10--Покровський район
('Поштовий проспект', 7),       --11--Центрально-Міський район
('Проспект Металургів', 3),     --12--Металургійний район
('Симбірцева', 4),              --13--Покровський район
('Центральна', 6)               --14--Тернівський район

--Таблиця "Види будівель" 
--  потрібно заповнити стовпці:
--    * Вид будівлі
Insert into Building_types (BuildingTypeName) values
('Житловий будинок'),           --1
('Заклад дошкільної освіти'),   --2
('Заклад середньої освіти'),    --3
('Заклад вищої освіти'),        --4
('Заклад спеціальної освіти'),  --5
('Лікарня'),                    --6
('Нежитловий будинок')          --7

--Таблиця "Адреси"
--  потрібно заповнити стовпці:
--    * ID вулиці
--    * Номер будинку
--    * Номер квартири
--    * Номер офісу
--    * ID виду будівлі
--    * Назва закладу
Insert into Addresses (Street, House, Flat, Office, BuildingType, EstablishmentName) values
-- ОМС 
(5, '1', Null, Null, 7, 'Виконавчий комітет міської ради'),  --1--вул. Молодіжна №1, Металіргійний район
-- ОРС
(2, '27', Null, Null, 7, 'Виконавчий комітет Центрально-міського району'), --2--вул. Свято-Миколаївська №27, Цетрально-Міський район
(6, '32', Null, Null, 7, 'Виконавчий комітет Саксаганського району'),      --3--вул. Володимира Великого №32, Саксаганський район
(7, '44А', Null, Null, 7, 'Виконавчий комітет Металургійного району'),     --4--вул. Проспект Миру №44А, Металургійний район
(8, '1А', Null, Null, 7, 'Виконавчий комітет Тернівського району'),        --5--вул. Короленка №1А, Тернівський район
(3, '11', Null, Null, 7, 'Виконавчий комітет Довгинцівського району'),     --6--вул. Дніпровське шосе №11, Довгинцівський район
(9, '1', Null, Null, 7, 'Виконавчий комітет Інгулецького району'),         --7--вул. Площа Гірницької Слави №1, Інгулецький район
(10, '2', Null, Null, 7, 'Виконавчий комітет Покровського району'),        --8--вул. Шурупова №2, Покровський район
-- ОСББ
(1, '1', Null, Null, 1, 'ОСББ "Мрія"'),        --9--вул. Бикова №1, Саксаганський район
(2, '52А', Null, Null, 1, 'ОСББ "Пролісок"'),  --10--вул. Свято-Моколаївська №52А, Центрально-Міський район
(3, '2', Null, Null, 1, 'ОСББ "Снігур"'),      --11--вул. Дніпровське шосе №2, Довгинцівський район
(4, '56', Null, Null, 1, 'ОСББ "Світанок"'),   --12--вул. Крипивницького №56, Покровський район
-- Звичайні юзери
(1, '1', '7', Null, 1, Null),     --13--вул. Бикова №1, кв.№7, Саксаганський район
(11, '30', '5', Null, 1, Null),   --14--вул. Поштовий проспект №30, кв. 5, Центрально-Міський район
(12, '22', '15', Null, 1, Null),  --15--вул. Металіргів №22, кв.№15, Металургійний район
(13, '4', '10', Null, 1, Null),   --16--вул. Симбірцева №4, кв.№10, Покровський район
(14, '1', Null, Null, 1, Null)    --17--вул. Центральна №1, Тернівський район

--Таблиця "Типи датчиків"
--  потрібно заповнити стовпці:
--    * Назва типу датчика 
Insert into SensorTypes (SensorTypeName) values
('Температури повітря'),    --1
('Тиску'),                  --2
('Температури теплоносія')  --3

--Таблиця "Датчики"
--  потрібно заповнити стовпці:
--    * ID типу датчика
--    * ID адреси
Insert into Sensors (SensorType, SensorAddress) values
(1, 13),      --Температури повітря 
(2, 13),      --Тиску 
(3, 13),      --Температури теплоносія 
(1, 14),      --Температури повітря 
(2, 14),      --Тиску 
(3, 14)       --Температури теплоносія 

--Таблиця "Показники"
--  потрібно заповнити стовпці:
--    * ID датчика
--    * Дата та час, зняття показника
--    * Значення показника
Insert into Indicators (Sensor, IndDate, Indicator) values
(3, '2023-12-02', 45.3),  --Температури теплоносія
(4, '2023-12-03', 20.8),  --Температури повітря
(2, '2023-12-06', 1.5),   --Тиску
(5, '2023-12-08', 1.34),  --Тиску
(2, '2023-12-10', 1.45),  --Тиску
(6, '2023-12-11', 49.9),  --Температури теплоносія
(1, '2023-12-12', 20.1),  --Температури повітря
(3, '2023-12-13', 47.4),  --Температури теплоносія
(5, '2023-12-14', 1.3),   --Тиску
(4, '2023-12-15', 19.5)   --Температури повітря

--Таблиця "Ролі"
--  потрібно заповнити стовпці:
--    * ID Ролі у системі
--    * Назва ролі
Insert into UserRoles (RoleName) values
('Адміністатор'),   --1 
('Інженер'),        --2
('ОМС'),            --3
('ОРС'),            --4
('ОСББ'),           --5
('Користувач')      --6

--Таблиця "Користувачі"
--  потрібно заповнити стовпці:
--    * ID Людини
--    * Логін користувача
--    * Пароль користувача
--    * ID Ролі
--    * Прізвище
--    * Ім'я
--    * По-батькові
--    * Стать
--    * Дата народження
--    * Номер телефону
--    * Резервний номер телефону
--    * ID адреси, за якою проживає людина
Insert into Users (UserLogin, UserPassword, UserRole, Surname, PrsnName, SecondName, Gender, BirthDate, PhoneNumber, RsrvPhoneNumber, AddressInfo) values
-- Адміни
('YorYNGSteO', 'S27kF6rAW0NI2TxtGfEK', 1, 'Кублік', 'Денис', 'Дмитрович', 'М', '1997-08-22', '+380505861242', Null, Null),            --1 
('CuRYPErice', 'Jzi24981P0ibAymmjc8G', 1, 'Клипка', 'Дарія', 'Володимирівна', 'Ж', '1997-04-17', '+380669953366', Null, Null),        --2
-- Персонал
('iTaTEReAnA', '0iJpm159pymENyRctZe2', 2, 'Желтуха', 'Владислав', 'Володимирович', 'М', '1999-04-18', '+380977758869', Null, Null),   --3 
('EXoRKSkiMi', 'T6q2Y8FfL00BDeTIk5T5', 2, 'Гаченко', 'Артем', 'Ігорович', 'М', '1966-11-23', '+380672558777', Null, Null),            --4 
('aRthANoRtI', '27VAl31ah73ZcnrWt9JI', 2, 'Степанюк', 'Дмитро', 'Іванович', 'М', '1985-05-31', '+380686662255', Null, Null),          --5 
('LenCiteAdi', 'rE67Tcn72Lr7nEEes68q', 2, 'Бойко', 'Семен', 'Владиславович', 'М', '1984-09-15', '+380697758811', Null, Null),         --6 
('IgMusCranD', '79XnB45gDaOdpjndbdQz', 2, 'Максимов', 'Ігор', 'Валерійович', 'М', '1997-05-12', '+380971113366', Null, Null),         --7 
('ulEurAMulK', '2x6ZSOy8EmyM2MiIM2wJ', 2, 'Макаренко', 'Сергій', 'Денисович', 'М', '1987-06-23', '+380502588666', Null, Null),        --8 
-- ОМС 
('uNedICTIpT', 'D3w5R2l8Caeup6fpAedY', 3, 'Крилеко', 'Василь', 'Дмитрович', 'М', '1989-01-24', '+380665558877', Null, 1),             --9
('pLESTArgIN', 'w1L20fahn6G2jrqWfpav', 3, 'Савченко', 'Ілля', 'Семенович', 'М', '1990-11-20', '+380984442266', Null, 1),              --10
('ViLvApHoUT', '3d2H4xGzBivu4kq7C7Ek', 3, 'Карпов', 'Владислав', 'Вікторович', 'М', '1988-03-23', '+380503332456', Null, 1),          --11
-- ОРС
('EgrateryAn', 'lM348MxJMV4EV2XpHTn9', 4, 'Пугач', 'Данило', 'Аркадійович', 'М', '1998-06-11', '+380667754331', Null, 2),             --12 
('PloTIcIChr', 'iH0j3k54UO6u6c489E4h', 4, 'Вєтров', 'Іван', 'Сергійович', 'М', '1978-07-30', '+380680009765', Null, 3),               --13
('IShriAndHa', '55xfVM1WGzTj0INOlLSi', 4, 'Стус', 'Світлана', 'Артемівна', 'Ж', '1982-03-12', '+380663469954', Null, 4),              --14            
('OBsiMPaTER', 'u5A3n6IrB321RcrlXrb2', 4, 'Тесла', 'Степан', 'Макcимович', 'М', '1982-12-09', '+380505785212', Null, 5),              --15
('rEAvICKNEw', 'Aw594a8sLydAM0SP265x', 4, 'Василець', 'Ольга', 'Кирилівна', 'Ж', '1991-04-28', '+380974853217', Null, 6),             --16
-- ОСББ
('TRysiONaRM', 'Xa1WI20iDlert71pL4Bm', 5, 'Кузьмова', 'Александра', 'Вікторівна', 'Ж', '1972-12-06', '+380674315269', Null, 9),       --17
('cRISTrIseb', 'uO6802pNvv32UhQ904Yx', 5, 'Столяренко', 'Ірина', 'Денисівна', 'Ж', '1976-09-20', '+380665512236', Null, 10),          --18
('IsHENatocI', '3U96h8221cc5TYeUPb1c', 5, 'Брозинський', 'Андрій', 'Васильович', 'М', '1983-04-14', '+380504444451', Null, 11),       --19
('SEnTypitUF', 'M60e2e5SvS4K0VPnU5zM', 5, 'Кривенко', 'Аркадій', 'Вікторович', 'М', '1984-01-21', '+380634657533', Null, 12),         --20
-- Звичайні юзери
('ROurIaTERN', '1mK95yBEx4Wjp8CnFs6L', 6, 'Тесленко', 'Дмитро', 'Богданович', 'М', '1987-10-10', '+380973344445', Null, 13),          --21
('RegousCROg', 'J3o40HLZlHd3X0gq62NJ', 6, 'Івасенко', 'Анастасія', 'Романівна', 'Ж', '1998-02-18', '+380988888654', Null, 14),        --22
('MenVACkbeN', 'jK12896SGzOnC56g42zs', 6, 'Петренко', 'Максим', 'Леонідович', 'М', '1996-12-03', '+380677543460', Null, 15),          --23
('ankiNOXyLa', 'vVkI3z7qFD2tjC0EZsCs', 6, 'Ткаченко', 'Ярослав', 'Олександрович', 'М', '1969-10-12', '+380970000876', Null, 16),      --24
('FinETABoUG', '6rX33U4j6JOKEpRehMDY', 6, 'Тиква', 'Анастасія', 'Артемівна', 'Ж', '1999-01-27', '+380507778862', Null, 17)            --25

--Таблиця "Технічні роботи"
--  потрібно заповнити стовпці:
--    * ID відповідального робітника
--    * ID адреси проведення робіт
--    * Тип виконуваної роботи
--    * Статус виконання роботи
--    * Дата початку роботи
--    * Дата закінчення роботи
Insert into Maintenance (StaffUserID, MaintAddress, MaintType, MaintStatus, MaintStartDate, MaintEndDate) values
(4, 11, 'Ремонт котелень', 'Закінчено', '2023-09-01', '2023-09-08'),
(8, 17, 'Установка датчиків температури повітря', 'Закінчено', '2023-09-28', '2023-09-28'),
(4, 13, 'Усунення протікання', 'Закінчено', '2023-10-05', '2023-10-06'),
(3, 15, 'Заміна засувок', 'Закінчено', '2023-10-18', '2023-10-20'),
(5, 14, 'Установка датчиків тиску', 'Закінчено', '2023-10-30', '2023-10-30'),
(5, 10, 'Перевірка справності тепломережі', 'Закінчено', '2023-11-03', '2023-11-06'),
(6, 16, 'Заміна несправних датчиків', 'Закінчено', '2023-11-06', '2023-11-07'),
(3, 12, 'Ремонт теплоізоляції', 'Закінчено', '2023-11-07', '2023-11-12'),
(7, 13, 'Ремонт датчиків температури теплоносія', 'Закінчено', '2023-11-29', '2023-12-02'),
(8, 9, 'Заміна труб у тепломережі', 'Заявку затверджено, очікування поставки потрібних матеріалів', '2023-12-16', Null)